sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.h
/*!
    \file    gd32a7xx_mcmu.h
    \brief   definitions for the MCMU

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#ifndef GD32A7XX_MCMU_H
#define GD32A7XX_MCMU_H

#include "gd32a7xx.h"

/* PMU definitions */
#define MCMUA                       MCMU_BASE                       /*!< MCMUA base address */
#define MCMUB                       (MCMU_BASE+0x00000400U)         /*!< MCMUB base address */

/* registers definitions */
#define MCMU_PAR(mcmux)             REG32((mcmux) + 0x00000004U)    /*!< Parameter register */
#define MCMU_CTL(mcmux)             REG32((mcmux) + 0x00000008U)    /*!< Control register */
#define MCMU_STAT(mcmux)            REG32((mcmux) + 0x0000000CU)    /*!< Status register */
#define MCMU_SCTL(mcmux)            REG32((mcmux) + 0x00000100U)    /*!< Signal control register */
#define MCMU_SSTAT(mcmux)           REG32((mcmux) + 0x00000104U)    /*!< Signal status register */
#define MCMU_NINTEN(mcmux)          REG32((mcmux) + 0x00000110U)    /*!< Normal interrupt enable register */
#define MCMU_NINTCTL(mcmux)         REG32((mcmux) + 0x00000114U)    /*!< Normal interrupt control register */
#define MCMU_NINTSTAT(mcmux)        REG32((mcmux) + 0x00000118U)    /*!< Normal interrupt Status register */
#define MCMU_TINTCTL(mcmux)         REG32((mcmux) + 0x00000120U)    /*!< Transmit Interrupt Control register */
#define MCMU_TINTSTAT(mcmux)        REG32((mcmux) + 0x00000124U)    /*!< Transmit Interrupt Status register */
#define MCMU_RINTCTL(mcmux)         REG32((mcmux) + 0x00000128U)    /*!< Receive Interrupt Control register */
#define MCMU_RINTSTAT(mcmux)        REG32((mcmux) + 0x0000012CU)    /*!< Receive Interrupt Status register */
#define MCMU_TDATA(mcmux,chy)       REG32((mcmux) + 0x00000200U + (chy) * 0x04U)   /*!< Transmit data register */
#define MCMU_RDATA(mcmux,chy)       REG32((mcmux) + 0x00000280U + (chy) * 0x04U)   /*!< Receive data register */
#define MCMU_PERRSTAT(mcmux)        REG32((mcmux) + 0x00000300U)   /*!< Parity Error Status register */
#define MCMU_PERRFE(mcmux)          REG32((mcmux) + 0x00000304U)   /*!< Parity Error fault enable register */
#define MCMU_TMRFACS(mcmux)         REG32((mcmux) + 0x00000308U)   /*!< TMR fault control and status register */

/* bits definitions */
/* MCMU_PAR */
#define MCMU_PAR_TRNUM                BITS(0,7)                     /*!< The number of transmit registers */
#define MCMU_PAR_RRNUM                BITS(8,15)                    /*!< The number of receive registers */
#define MCMU_PAR_NINTNUM              BITS(16,23)                   /*!< The number of normal interrupt requests available */
#define MCMU_PAR_SIGNALNUM            BITS(24,31)                   /*!< The number of signal bits */

/* MCMU_CTL */
#define MCMU_CTL_SWRST                BIT(0)                        /*!< Software reset MCMU */

/* MCMU_STAT */
#define MCMU_STAT_RSTSF               BIT(0)                        /*!< MCMU reset state flag */
#define MCMU_STAT_RSTIF               BIT(1)                        /*!< MCMU reset interrupt flag */
#define MCMU_STAT_EVF                 BIT(2)                        /*!< MCMU event flag */
#define MCMU_STAT_SUF                 BIT(3)                        /*!< MCMU Signal update flag */
#define MCMU_STAT_NIF                 BIT(4)                        /*!< MCMU Normal interrupt flag */
#define MCMU_STAT_TEF                 BIT(5)                        /*!< MCMU Transmit empty flag */
#define MCMU_STAT_RNEF                BIT(6)                        /*!< MCMU Receive not empty flag */

/* MCMU_SCTL */
#define MCMU_SCTL_SIGNAL0             BIT(0)                        /*!< signal0 to the other MCMU */
#define MCMU_SCTL_SIGNAL1             BIT(1)                        /*!< signal1 to the other MCMU */
#define MCMU_SCTL_SIGNAL2             BIT(2)                        /*!< signal2 to the other MCMU */

/* MCMU_SSTAT */
#define MCMU_STAT_SIGNAL0S            BIT(0)                        /*!< signal0 from the other MCMU */
#define MCMU_STAT_SIGNAL1S            BIT(1)                        /*!< signal1 from the other MCMU */
#define MCMU_STAT_SIGNAL2S            BIT(2)                        /*!< signal2 from the other MCMU */

/* MCMU_NINTEN */
#define MCMU_NINTEN_NIE0              BIT(0)                        /*!< Enable normal interrupt */

/* MCMU_NINTCTL */
#define MCMU_NINTCTL_NIR0             BIT(0)                        /*!< normal interrupt request */

/* MCMU_NINTSTAT */
#define MCMU_NINTSTAT_NIF0            BIT(0)                        /*!< normal interrupt flag */

/* MCMU_TINTCTL */
#define MCMU_TINTCTL_TIE0             BIT(0)                        /*!< transmit 0 interrupt enable */
#define MCMU_TINTCTL_TIE1             BIT(1)                        /*!< transmit 1 interrupt enable */
#define MCMU_TINTCTL_TIE2             BIT(2)                        /*!< transmit 2 interrupt enable */
#define MCMU_TINTCTL_TIE3             BIT(3)                        /*!< transmit 3 interrupt enable */

/* MCMU_TINTSTAT */
#define MCMU_TINTSTAT_TEF0            BIT(0)                        /*!< transmit register 0 empty */
#define MCMU_TINTSTAT_TEF1            BIT(1)                        /*!< transmit register 1 empty */
#define MCMU_TINTSTAT_TEF2            BIT(2)                        /*!< transmit register 2 empty */
#define MCMU_TINTSTAT_TEF3            BIT(3)                        /*!< transmit register 3 empty */

