sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.h
/* MCMU_RINTCTL */
#define MCMU_RINTCTL_RIE0             BIT(0)                        /*!< receive 0 interrupt enable */
#define MCMU_RINTCTL_RIE1             BIT(1)                        /*!< receive 1 interrupt enable */
#define MCMU_RINTCTL_RIE2             BIT(2)                        /*!< receive 2 interrupt enable */
#define MCMU_RINTCTL_RIE3             BIT(3)                        /*!< receive 3 interrupt enable */

/* MCMU_RINTSTAT */
#define MCMU_RINTSTAT_RNEF0           BIT(0)                        /*!< receive register 0 not empty */
#define MCMU_RINTSTAT_RNEF1           BIT(1)                        /*!< receive register 1 not empty */
#define MCMU_RINTSTAT_RNEF2           BIT(2)                        /*!< receive register 2 not empty */
#define MCMU_RINTSTAT_RNEF3           BIT(3)                        /*!< receive register 3 not empty */

/* MCMU_TDATA */
#define MCMU_TDATA_TDATA              BITS(0,31)                    /*!< Transmit Data */

/* MCMU_RDATA */
#define MCMU_RDATA_RDATA              BITS(0,31)                    /*!< Receive Data */

/* MCMU_PERRSTAT */
#define MCMU_PERRSTAT_PERR0F          BIT(0)                        /*!< receive register 0 parity check error flag */
#define MCMU_PERRSTAT_PERR1F          BIT(1)                        /*!< receive register 1 parity check error flag */
#define MCMU_PERRSTAT_PERR2F          BIT(2)                        /*!< receive register 2 parity check error flag */
#define MCMU_PERRSTAT_PERR3F          BIT(3)                        /*!< receive register 3 parity check error flag */

/* MCMU_PERRFE */
#define MCMU_PERRFE_PERR0FE           BIT(0)                        /*!< enable receive register 0 parity check error connection to FMU */
#define MCMU_PERRFE_PERR1FE           BIT(1)                        /*!< enable receive register 1 parity check error connection to FMU */
#define MCMU_PERRFE_PERR2FE           BIT(2)                        /*!< enable receive register 2 parity check error connection to FMU */
#define MCMU_PERRFE_PERR3FE           BIT(3)                        /*!< enable receive register 3 parity check error connection to FMU */

/* MCMU_TMRFACS */
#define MCMU_TMRFACS_SCTLIE           BIT(1)                        /*!< enable TMR fault alarm of SCTL register to FMU */
#define MCMU_TMRFACS_NINTIE           BIT(2)                        /*!< enable TMR fault alarm of NINTEN and NINTCTL registers to FMU */
#define MCMU_TMRFACS_TCTLIE           BIT(3)                        /*!< enable TMR fault alarm of TINTCTL register to FMU */
#define MCMU_TMRFACS_RCTLIE           BIT(4)                        /*!< enable TMR fault alarm of RINTCTL register to FMU */
#define MCMU_TMRFACS_SCTLIF           BIT(17)                       /*!< TMR fault alarm flag of SCTL register */
#define MCMU_TMRFACS_NINTIF           BIT(18)                       /*!< TMR fault alarm flag of NINTEN and NINTCTL registers */
#define MCMU_TMRFACS_TCTLIF           BIT(19)                       /*!< TMR fault alarm flag of TINTCTL register */
#define MCMU_TMRFACS_RCTLIF           BIT(20)                       /*!< TMR fault alarm flag of RINTCTL register */

/* constants definitions */
/* MCMU parameter type */
typedef enum {
    MCMU_PAR_TRANSMIT = 0U,         /*!< The number of transmit registers */
    MCMU_PAR_RECEIVE,               /*!< The number of receive registers */
    MCMU_PAR_NORMAL,                /*!< The number of normal interrupt requests available */
    MCMU_PAR_SIGNAL                 /*!< The number of signal bits */
} mcmu_parameter_enum;

/* define the MCMU bit position and its register index offset REG2[31:22] BIT2[21:16] REG[15:6] BIT[5:0] */
#define MCMU_REGIDX_BIT(regidx, bitpos)     (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define MCMU_REG_VAL(mcmux, offset)        (REG32((mcmux) + (((uint32_t)(offset) & 0x0000FFC0U) >> 6)))
#define MCMU_BIT_POS(val)                   ((uint32_t)(val) & 0x0000001FU)
#define MCMU_REGIDX_BIT2(regidx2, bitpos2, regidx, bitpos)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16) |\
                                                              (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define MCMU_REG_VAL2(mcmux, offset)       (REG32((mcmux) + (((uint32_t)(offset) & 0xFFC00000U) >> 22)))
#define MCMU_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define MCMU_CTL_REG_OFFSET         ((uint32_t)0x008U)        /*!< Control register offset */
#define MCMU_STAT_REG_OFFSET        ((uint32_t)0x00CU)        /*!< Status register offset */
#define MCMU_SCTL_REG_OFFSET        ((uint32_t)0x100U)        /*!< Signal control register offset */
#define MCMU_SSTAT_REG_OFFSET       ((uint32_t)0x104U)        /*!< Signal status register offset */
#define MCMU_NINTEN_REG_OFFSET      ((uint32_t)0x110U)        /*!< Normal interrupt enable register offset */
#define MCMU_NINTCTL_REG_OFFSET     ((uint32_t)0x114U)        /*!< Normal interrupt control register offset */
#define MCMU_NINTSTAT_REG_OFFSET    ((uint32_t)0x118U)        /*!< Normal interrupt Status register offset */
#define MCMU_TINTCTL_REG_OFFSET     ((uint32_t)0x120U)        /*!< Transmit Interrupt Control register offset */
#define MCMU_TINTSTAT_REG_OFFSET    ((uint32_t)0x124U)        /*!< Transmit Interrupt Status register offset */
#define MCMU_RINTCTL_REG_OFFSET     ((uint32_t)0x128U)        /*!< Receive Interrupt Control register offset */
#define MCMU_RINTSTAT_REG_OFFSET    ((uint32_t)0x12CU)        /*!< Receive Interrupt Status register offset */

/* enable or disable MCMU interrupt */
typedef enum {
    /* MCMU_NINTEN register */
    MCMU_INT_NIF0               = MCMU_REGIDX_BIT(MCMU_NINTEN_REG_OFFSET, 0U),          /*!< normal interrupt */
    /* MCMU_TINTCTL register */
    MCMU_INT_TEF0               = MCMU_REGIDX_BIT(MCMU_TINTCTL_REG_OFFSET, 0U),         /*!< transmit interrupt 0 */
    MCMU_INT_TEF1               = MCMU_REGIDX_BIT(MCMU_TINTCTL_REG_OFFSET, 1U),         /*!< transmit interrupt 1 */
    MCMU_INT_TEF2               = MCMU_REGIDX_BIT(MCMU_TINTCTL_REG_OFFSET, 2U),         /*!< transmit interrupt 2 */
    MCMU_INT_TEF3               = MCMU_REGIDX_BIT(MCMU_TINTCTL_REG_OFFSET, 3U),         /*!< transmit interrupt 3 */
    /* MCMU_RINTCTL register */
    MCMU_INT_RNEF0              = MCMU_REGIDX_BIT(MCMU_RINTCTL_REG_OFFSET, 0U),         /*!< receive interrupt 0 */
    MCMU_INT_RNEF1              = MCMU_REGIDX_BIT(MCMU_RINTCTL_REG_OFFSET, 1U),         /*!< receive interrupt 1 */
    MCMU_INT_RNEF2              = MCMU_REGIDX_BIT(MCMU_RINTCTL_REG_OFFSET, 2U),         /*!< receive interrupt 2 */
    MCMU_INT_RNEF3              = MCMU_REGIDX_BIT(MCMU_RINTCTL_REG_OFFSET, 3U)          /*!< receive interrupt 3 */
} mcmu_interrupt_enum;

