sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.h
/* MCMU flags */
typedef enum {
    /* MCMU_STAT register */
    MCMU_FLAG_RSTSF     = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 0U),        /*!< MCMU reset state flag */
    MCMU_FLAG_RSTIF     = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 1U),        /*!< MCMU reset interrupt flag */
    MCMU_FLAG_EVF       = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 2U),        /*!< MCMU side event flag */
    MCMU_FLAG_SUF       = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 3U),        /*!< MCMU Signal update flag */
    MCMU_FLAG_NIF       = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 4U),        /*!< MCMU Normal interrupt flag */
    MCMU_FLAG_TEF       = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 5U),        /*!< MCMU Transmit empty flag */
    MCMU_FLAG_RNEF      = MCMU_REGIDX_BIT(MCMU_STAT_REG_OFFSET, 6U),        /*!< MCMU Receive not empty flag */
    /* MCMU_SCTL register */
    MCMU_FLAG_SIGNAL0   = MCMU_REGIDX_BIT(MCMU_SCTL_REG_OFFSET, 0U),        /*!< signal0 to the other MCMU */
    MCMU_FLAG_SIGNAL1   = MCMU_REGIDX_BIT(MCMU_SCTL_REG_OFFSET, 1U),        /*!< signal1 to the other MCMU */
    MCMU_FLAG_SIGNAL2   = MCMU_REGIDX_BIT(MCMU_SCTL_REG_OFFSET, 2U),        /*!< signal2 to the other MCMU */
    /* MCMU_SSTAT register */
    MCMU_FLAG_SIGNAL0S  = MCMU_REGIDX_BIT(MCMU_SSTAT_REG_OFFSET, 0U),       /*!< signal0 from the other MCMU */
    MCMU_FLAG_SIGNAL1S  = MCMU_REGIDX_BIT(MCMU_SSTAT_REG_OFFSET, 1U),       /*!< signal1 from the other MCMU */
    MCMU_FLAG_SIGNAL2S  = MCMU_REGIDX_BIT(MCMU_SSTAT_REG_OFFSET, 2U),       /*!< signal2 from the other MCMU */
    /* MCMU_NINTCTL register */
    MCMU_FLAG_NIR0      = MCMU_REGIDX_BIT(MCMU_NINTCTL_REG_OFFSET, 0U),     /*!< normal interrupt request (only be cleared by the other MCMU) */
    /* MCMU_NINTSTAT register */
    MCMU_FLAG_NIF0      = MCMU_REGIDX_BIT(MCMU_NINTSTAT_REG_OFFSET, 0U),    /*!< normal interrupt flag from the other MCMU */
    /* MCMU_TINTSTAT register */
    MCMU_FLAG_TEF0      = MCMU_REGIDX_BIT(MCMU_TINTSTAT_REG_OFFSET, 0U),    /*!< transmit data register 0 empty flag */
    MCMU_FLAG_TEF1      = MCMU_REGIDX_BIT(MCMU_TINTSTAT_REG_OFFSET, 1U),    /*!< transmit data register 1 empty flag */
    MCMU_FLAG_TEF2      = MCMU_REGIDX_BIT(MCMU_TINTSTAT_REG_OFFSET, 2U),    /*!< transmit data register 2 empty flag */
    MCMU_FLAG_TEF3      = MCMU_REGIDX_BIT(MCMU_TINTSTAT_REG_OFFSET, 3U),    /*!< transmit data register 3 empty flag */
    /* MCMU_RINTSTAT register */
    MCMU_FLAG_RNEF0     = MCMU_REGIDX_BIT(MCMU_RINTSTAT_REG_OFFSET, 0U),    /*!< receive data register 0 not empty */
    MCMU_FLAG_RNEF1     = MCMU_REGIDX_BIT(MCMU_RINTSTAT_REG_OFFSET, 1U),    /*!< receive data register 1 not empty */
    MCMU_FLAG_RNEF2     = MCMU_REGIDX_BIT(MCMU_RINTSTAT_REG_OFFSET, 2U),    /*!< receive data register 2 not empty */
    MCMU_FLAG_RNEF3     = MCMU_REGIDX_BIT(MCMU_RINTSTAT_REG_OFFSET, 3U)     /*!< receive data register 3 not empty */
} mcmu_flag_enum;

/* MCMU interrupt flags */
typedef enum {
    /* MCMU_NINTSTAT register */
    MCMU_INT_FLAG_NIF0          = MCMU_REGIDX_BIT2(MCMU_NINTEN_REG_OFFSET, 0U, MCMU_NINTSTAT_REG_OFFSET, 0U),     /*!< normal interrupt flag from the other MCMU */
    /* MCMU_TINTCTL register */
    MCMU_INT_FLAG_TEF0          = MCMU_REGIDX_BIT2(MCMU_TINTCTL_REG_OFFSET, 0U, MCMU_TINTSTAT_REG_OFFSET, 0U),      /*!< transmit data register 0 empty flag */
    MCMU_INT_FLAG_TEF1          = MCMU_REGIDX_BIT2(MCMU_TINTCTL_REG_OFFSET, 1U, MCMU_TINTSTAT_REG_OFFSET, 1U),      /*!< transmit data register 1 empty flag */
    MCMU_INT_FLAG_TEF2          = MCMU_REGIDX_BIT2(MCMU_TINTCTL_REG_OFFSET, 2U, MCMU_TINTSTAT_REG_OFFSET, 2U),      /*!< transmit data register 2 empty flag */
    MCMU_INT_FLAG_TEF3          = MCMU_REGIDX_BIT2(MCMU_TINTCTL_REG_OFFSET, 3U, MCMU_TINTSTAT_REG_OFFSET, 3U),      /*!< transmit data register 3 empty flag */
    /* MCMU_RINTCTL register */
    MCMU_INT_FLAG_RNEF0         = MCMU_REGIDX_BIT2(MCMU_RINTCTL_REG_OFFSET, 0U, MCMU_RINTSTAT_REG_OFFSET, 0U),      /*!< receive data register 0 not empty flag */
    MCMU_INT_FLAG_RNEF1         = MCMU_REGIDX_BIT2(MCMU_RINTCTL_REG_OFFSET, 1U, MCMU_RINTSTAT_REG_OFFSET, 1U),      /*!< receive data register 1 not empty flag */
    MCMU_INT_FLAG_RNEF2         = MCMU_REGIDX_BIT2(MCMU_RINTCTL_REG_OFFSET, 2U, MCMU_RINTSTAT_REG_OFFSET, 2U),      /*!< receive data register 2 not empty flag */
    MCMU_INT_FLAG_RNEF3         = MCMU_REGIDX_BIT2(MCMU_RINTCTL_REG_OFFSET, 3U, MCMU_RINTSTAT_REG_OFFSET, 3U)       /*!< receive data register 3 not empty flag */
} mcmu_interrupt_flag_enum;

/* MCMU signal */
#define MCMU_SIGNAL0        MCMU_SCTL_SIGNAL0                   /*!< MCMU signal0 to the other MCMU */
#define MCMU_SIGNAL1        MCMU_SCTL_SIGNAL1                   /*!< MCMU signal1 to the other MCMU */
#define MCMU_SIGNAL2        MCMU_SCTL_SIGNAL2                   /*!< MCMU signal2 to the other MCMU */

/* MCMU TMR fault alarm enable */
#define MCMU_TMR_ALARM_SCTL          MCMU_TMRFACS_SCTLIE        /* TMR fault alarm of SCTL register to FMU */
#define MCMU_TMR_ALARM_NINT          MCMU_TMRFACS_NINTIE        /* TMR fault alarm of NINTEN and NINTCTL registers to FMU */
#define MCMU_TMR_ALARM_TINT          MCMU_TMRFACS_TCTLIE        /* TMR fault alarm of TINTCTL register to FMU */
#define MCMU_TMR_ALARM_RINT          MCMU_TMRFACS_RCTLIE        /* TMR fault alarm of RINTCTL register to FMU */

/* MCMU TMR fault flags */
#define MCMU_TMR_FLAG_SCTL            MCMU_TMRFACS_SCTLIF       /* TMR fault alarm flag of SCTL register */
#define MCMU_TMR_FLAG_NINT            MCMU_TMRFACS_NINTIF       /* TMR fault alarm flag of NINTEN and NINTCTL registers */
#define MCMU_TMR_FLAG_TINT            MCMU_TMRFACS_TCTLIF       /* TMR fault alarm flag of TINTCTL register */
#define MCMU_TMR_FLAG_RINT            MCMU_TMRFACS_RCTLIF       /* TMR fault alarm flag of RINTCTL register */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_MCMU_PERIPH(periph)          (((periph) != MCMUA) && ((periph) != MCMUB))

/* check parameter type */
#define NOT_MCMU_PARAMETER(para)         (((para) != MCMU_PAR_TRANSMIT)   && \
                                          ((para) != MCMU_PAR_RECEIVE)    && \
                                          ((para) != MCMU_PAR_NORMAL)     && \
                                          ((para) != MCMU_PAR_SIGNAL))

/* check signal */
#define NOT_MCMU_SIGNAL(signal)         (((signal) != MCMU_SIGNAL0) && \
                                         ((signal) != MCMU_SIGNAL1) && \
                                         ((signal) != MCMU_SIGNAL2))

/* check Transmit/Receive data channel  */
#define MCMU_DATA_CHANNEL_HIGH            (uint32_t)3U
#define NOT_MCMU_DATA_CHANNEL(ch)       ((ch) > MCMU_DATA_CHANNEL_HIGH)

