sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mcmu.h
/* check MCMU get flag */
#define NOT_MCMU_GET_FLAG(flag)         (((flag) != MCMU_FLAG_RSTSF)    && \
                                         ((flag) != MCMU_FLAG_RSTIF)    && \
                                         ((flag) != MCMU_FLAG_EVF)      && \
                                         ((flag) != MCMU_FLAG_SUF)      && \
                                         ((flag) != MCMU_FLAG_NIF)      && \
                                         ((flag) != MCMU_FLAG_TEF)      && \
                                         ((flag) != MCMU_FLAG_RNEF)     && \
                                         ((flag) != MCMU_FLAG_SIGNAL0)  && \
                                         ((flag) != MCMU_FLAG_SIGNAL1)  && \
                                         ((flag) != MCMU_FLAG_SIGNAL2)  && \
                                         ((flag) != MCMU_FLAG_SIGNAL0S) && \
                                         ((flag) != MCMU_FLAG_SIGNAL1S) && \
                                         ((flag) != MCMU_FLAG_SIGNAL2S) && \
                                         ((flag) != MCMU_FLAG_NIR0)     && \
                                         ((flag) != MCMU_FLAG_NIF0)     && \
                                         ((flag) != MCMU_FLAG_TEF0)     && \
                                         ((flag) != MCMU_FLAG_TEF1)     && \
                                         ((flag) != MCMU_FLAG_TEF2)     && \
                                         ((flag) != MCMU_FLAG_TEF3)     && \
                                         ((flag) != MCMU_FLAG_RNEF0)    && \
                                         ((flag) != MCMU_FLAG_RNEF1)    && \
                                         ((flag) != MCMU_FLAG_RNEF2)    && \
                                         ((flag) != MCMU_FLAG_RNEF3))

/* check MCMU clear flag */
#define NOT_MCMU_CLEAR_FLAG(flag)        (((flag) != MCMU_FLAG_RSTIF)   && \
                                          ((flag) != MCMU_FLAG_NIF0))

/* check MCMU interrupt */
#define NOT_MCMU_INTERRUPT(interrupt)   (((interrupt) != MCMU_INT_NIF0)    && \
                                         ((interrupt) != MCMU_INT_TEF0)    && \
                                         ((interrupt) != MCMU_INT_TEF1)    && \
                                         ((interrupt) != MCMU_INT_TEF2)    && \
                                         ((interrupt) != MCMU_INT_TEF3)    && \
                                         ((interrupt) != MCMU_INT_RNEF0)   && \
                                         ((interrupt) != MCMU_INT_RNEF1)   && \
                                         ((interrupt) != MCMU_INT_RNEF2)   && \
                                         ((interrupt) != MCMU_INT_RNEF3))

/* check MCMU interrupt get flag */
#define NOT_MCMU_INTERRUPT_GET_FLAG(flag)     (((flag) != MCMU_INT_FLAG_NIF0)     && \
                                               ((flag) != MCMU_INT_FLAG_TEF0)     && \
                                               ((flag) != MCMU_INT_FLAG_TEF1)     && \
                                               ((flag) != MCMU_INT_FLAG_TEF2)     && \
                                               ((flag) != MCMU_INT_FLAG_TEF3)     && \
                                               ((flag) != MCMU_INT_FLAG_RNEF0)    && \
                                               ((flag) != MCMU_INT_FLAG_RNEF1)    && \
                                               ((flag) != MCMU_INT_FLAG_RNEF2)    && \
                                               ((flag) != MCMU_INT_FLAG_RNEF3))

/* check MCMU interrupt clear flag */
#define NOT_MCMU_INTERRUPT_CLEAR_FLAG(flag)   ((flag) != MCMU_INT_FLAG_NIF0)

/* check MCMU TMR fault alarm */
#define NOT_MCMU_TMR_ALARM(alarm)             (((alarm) != MCMU_TMR_ALARM_SCTL)   && \
                                               ((alarm) != MCMU_TMR_ALARM_NINT)   && \
                                               ((alarm) != MCMU_TMR_ALARM_TINT)   && \
                                               ((alarm) != MCMU_TMR_ALARM_RINT))

/* check MCMU TMR fault flag */
#define NOT_MCMU_TMR_FLAG(flag)               (((flag) != MCMU_TMR_FLAG_SCTL)   && \
                                               ((flag) != MCMU_TMR_FLAG_NINT)   && \
                                               ((flag) != MCMU_TMR_FLAG_TINT)   && \
                                               ((flag) != MCMU_TMR_FLAG_RINT))
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* get available number of MCMU parameter */
uint8_t mcmu_parameter_get(uint32_t mcmu_periph, mcmu_parameter_enum para_type);
/* reset MCMU register */
void mcmu_reset(uint32_t mcmu_periph);

/* set the signal to the other MCMU */
void mcmu_signal_set(uint32_t mcmu_periph, uint32_t signal);
/* clear the signal to the other MCMU */
void mcmu_signal_clear(uint32_t mcmu_periph, uint32_t signal);

/* generate the normal interrupt to the other MCMU */
void mcmu_normal_interrupt_request(uint32_t mcmu_periph);

/* transmit data */
void mcmu_transmit_data(uint32_t mcmu_periph, uint32_t chy, uint32_t data);
/* receive data */
uint32_t mcmu_receive_data(uint32_t mcmu_periph, uint32_t chy);

/* mcmu interrupt enable */
void mcmu_interrupt_enable(uint32_t mcmu_periph, mcmu_interrupt_enum interrupt);
/* mcmu interrupt disable */
void mcmu_interrupt_disable(uint32_t mcmu_periph, mcmu_interrupt_enum interrupt);
/* get mcmu flag status */
FlagStatus mcmu_flag_get(uint32_t mcmu_periph, mcmu_flag_enum flag);
/* mcmu flag clear */
void mcmu_flag_clear(uint32_t mcmu_periph, mcmu_flag_enum flag);
/* get mcmu interrupt flag status */
FlagStatus mcmu_interrupt_flag_get(uint32_t mcmu_periph, mcmu_interrupt_flag_enum int_flag);
/* clear mcmu interrupt flag */
void mcmu_interrupt_flag_clear(uint32_t mcmu_periph, mcmu_interrupt_flag_enum int_flag);

/* parity error report to FMU */
void mcmu_parity_error_report_enable(uint32_t mcmu_periph, uint32_t chy);
/* parity error did not report to FMU */
void mcmu_parity_error_report_disable(uint32_t mcmu_periph, uint32_t chy);
/* parity error state get */
FlagStatus mcmu_parity_error_get(uint32_t mcmu_periph, uint32_t chy);
/* parity error clear */
void mcmu_parity_error_clear(uint32_t mcmu_periph, uint32_t chy);

/* tmr error report to FMU */
void mcmu_tmr_error_report_enable(uint32_t mcmu_periph, uint32_t tmr);
/* tmr error did not report to FMU */
void mcmu_tmr_error_report_disable(uint32_t mcmu_periph, uint32_t tmr);
/* tmr error flag get */
FlagStatus mcmu_tmr_error_get(uint32_t mcmu_periph, uint32_t tmr_flag);
/* tmr error flag clear */
void mcmu_tmr_error_clear(uint32_t mcmu_periph, uint32_t tmr_flag);

#endif /* GD32A7XX_MCMU_H */
#endif /* #if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
